
Функция ВыполнитьФункцию(ВнешнееИмяМетода, ПараметрыФункции) Экспорт
	ИмяОбработчика = ДопустимыеВнешниеИменаОбработчиков().Получить(ВнешнееИмяМетода);
	Если ИмяОбработчика = Неопределено Тогда
		ВызватьИсключение "Method name not allowed! '" + ВнешнееИмяМетода + "'!";
	КонецЕсли;
	СтруктураОтвета = Неопределено;
	Выполнить("СтруктураОтвета = " + ИмяОбработчика + "(ПараметрыФункции)");
	Возврат СтруктураОтвета;
КонецФункции

Функция ДопустимыеВнешниеИменаОбработчиков() Экспорт
	Соотверствие = Новый Соответствие;
	Соотверствие.Вставить("ping", "Пинг");
	Возврат Соотверствие;
КонецФункции

Функция Пинг(Параметры) Экспорт
	Возврат МарсОбщегоНазначения.СтруктураОтвета("pong");
КонецФункции
