
Функция ВыполнитьФункцию(ВнешнееИмяМетода, ПараметрыФункции) Экспорт
	ИмяОбработчика = ДопустимыеВнешниеИменаОбработчиков().Получить(ВнешнееИмяМетода);
	Если ИмяОбработчика = Неопределено Тогда
		ВызватьИсключение "Method name not allowed! '" + ВнешнееИмяМетода + "'!";
	КонецЕсли;
	СтруктураОтвета = Неопределено;
	Выполнить("СтруктураОтвета = " + ИмяОбработчика + "(ПараметрыФункции)");
	Возврат СтруктураОтвета;
КонецФункции

Функция ДопустимыеВнешниеИменаОбработчиков()
	Соотверствие = Новый Соответствие;
	Соотверствие.Вставить("ping", "Пинг");
	Соотверствие.Вставить("getProducts", "ПолучитьТовары");
	Возврат Соотверствие;
КонецФункции

Функция Пинг(Параметры)
	Возврат МарсОбщегоНазначения.СтруктураОтвета("pong");
КонецФункции

Функция ПолучитьТовары(Параметры)
	Массив = Новый Массив;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Товары.Код КАК Код,
	                      |	Товары.Наименование КАК Наименование,
	                      |	Товары.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Товары КАК Товары
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Код");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Новый Структура("uuid, name, code", МарсОбщегоНазначения.СсылкиUuid(Выборка.Ссылка), Выборка.Наименование, Выборка.Код));
	КонецЦикла;
	Возврат МарсОбщегоНазначения.СтруктураОтвета(Массив);
КонецФункции


